{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_13", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 177], "sparse": false}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "units": 30, "activation": "relu"}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "units": 60, "activation": "relu"}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_4", "units": 120, "activation": "relu"}, "name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_6", "units": 60, "activation": "relu"}, "name": "dense_6", "class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_5", "units": 10, "activation": "relu"}, "name": "dense_5", "class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_7", "units": 30, "activation": "relu"}, "name": "dense_7", "class_name": "Dense", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_9", "units": 100, "activation": "relu"}, "name": "dense_9", "class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_11", "units": 5, "activation": "relu"}, "name": "dense_11", "class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "units": 10, "activation": "relu"}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_2", "trainable": true}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_3", "trainable": true}, "name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_4", "trainable": true}, "name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["dense_9", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_5", "trainable": true}, "name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"config": {"name": "add_1", "trainable": true}, "name": "add_1", "class_name": "Add", "inbound_nodes": [[["dense_3", 0, 0, {}], ["dropout_2", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_8", "units": 15, "activation": "relu"}, "name": "dense_8", "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_10", "units": 20, "activation": "relu"}, "name": "dense_10", "class_name": "Dense", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_12", "units": 30, "activation": "relu"}, "name": "dense_12", "class_name": "Dense", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["add_1", 0, 0, {}], ["dense_8", 0, 0, {}], ["dense_10", 0, 0, {}], ["dense_12", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_13", "units": 1, "activation": "relu"}, "name": "dense_13", "class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.4"}