{"backend": "tensorflow", "config": {"name": "model_1", "output_layers": [["dense_13", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 177], "dtype": "float32"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 30}, "name": "dense_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "name": "dense_2", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 60}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "name": "dense_4", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 120}, "name": "dense_4", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "name": "dense_6", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 60}, "name": "dense_6", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.2}, "name": "dropout_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "name": "dense_5", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 10}, "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "name": "dense_7", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 30}, "name": "dense_7", "inbound_nodes": [[["dense_6", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_9", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 100}, "name": "dense_9", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_11", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 5}, "name": "dense_11", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "name": "dense_3", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 10}, "name": "dense_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.2}, "name": "dropout_2", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.2}, "name": "dropout_3", "inbound_nodes": [[["dense_7", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"trainable": true, "name": "dropout_4", "rate": 0.2}, "name": "dropout_4", "inbound_nodes": [[["dense_9", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"trainable": true, "name": "dropout_5", "rate": 0.2}, "name": "dropout_5", "inbound_nodes": [[["dense_11", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["dense_3", 0, 0, {}], ["dropout_2", 0, 0, {}]]], "class_name": "Add"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_8", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 15}, "name": "dense_8", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "name": "dense_10", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 20}, "name": "dense_10", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "name": "dense_12", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 30}, "name": "dense_12", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "name": "concatenate_1", "inbound_nodes": [[["add_1", 0, 0, {}], ["dense_8", 0, 0, {}], ["dense_10", 0, 0, {}], ["dense_12", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "name": "dense_13", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "units": 1}, "name": "dense_13", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense"}]}, "keras_version": "2.0.4", "class_name": "Model"}