{"config": {"input_layers": [["input_3", 0, 0]], "output_layers": [["dense_39", 0, 0]], "name": "model_3", "layers": [{"config": {"dtype": "float32", "name": "input_3", "batch_input_shape": [null, 177], "sparse": false}, "name": "input_3", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_27", "units": 30, "activation": "relu"}, "name": "dense_27", "class_name": "Dense", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_28", "units": 60, "activation": "relu"}, "name": "dense_28", "class_name": "Dense", "inbound_nodes": [[["dense_27", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_30", "units": 120, "activation": "relu"}, "name": "dense_30", "class_name": "Dense", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_32", "units": 60, "activation": "relu"}, "name": "dense_32", "class_name": "Dense", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_11", "trainable": true}, "name": "dropout_11", "class_name": "Dropout", "inbound_nodes": [[["dense_28", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_31", "units": 10, "activation": "relu"}, "name": "dense_31", "class_name": "Dense", "inbound_nodes": [[["dense_30", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_33", "units": 30, "activation": "relu"}, "name": "dense_33", "class_name": "Dense", "inbound_nodes": [[["dense_32", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_35", "units": 100, "activation": "relu"}, "name": "dense_35", "class_name": "Dense", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_37", "units": 5, "activation": "relu"}, "name": "dense_37", "class_name": "Dense", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_29", "units": 10, "activation": "relu"}, "name": "dense_29", "class_name": "Dense", "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_12", "trainable": true}, "name": "dropout_12", "class_name": "Dropout", "inbound_nodes": [[["dense_31", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_13", "trainable": true}, "name": "dropout_13", "class_name": "Dropout", "inbound_nodes": [[["dense_33", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_14", "trainable": true}, "name": "dropout_14", "class_name": "Dropout", "inbound_nodes": [[["dense_35", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_15", "trainable": true}, "name": "dropout_15", "class_name": "Dropout", "inbound_nodes": [[["dense_37", 0, 0, {}]]]}, {"config": {"name": "add_3", "trainable": true}, "name": "add_3", "class_name": "Add", "inbound_nodes": [[["dense_29", 0, 0, {}], ["dropout_12", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_34", "units": 15, "activation": "relu"}, "name": "dense_34", "class_name": "Dense", "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_36", "units": 20, "activation": "relu"}, "name": "dense_36", "class_name": "Dense", "inbound_nodes": [[["dropout_14", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_38", "units": 30, "activation": "relu"}, "name": "dense_38", "class_name": "Dense", "inbound_nodes": [[["dropout_15", 0, 0, {}]]]}, {"config": {"axis": -1, "name": "concatenate_3", "trainable": true}, "name": "concatenate_3", "class_name": "Concatenate", "inbound_nodes": [[["add_3", 0, 0, {}], ["dense_34", 0, 0, {}], ["dense_36", 0, 0, {}], ["dense_38", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_39", "units": 1, "activation": "relu"}, "name": "dense_39", "class_name": "Dense", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.4"}