{"config": {"input_layers": [["input_2", 0, 0]], "output_layers": [["dense_26", 0, 0]], "name": "model_2", "layers": [{"config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 177], "sparse": false}, "name": "input_2", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_14", "units": 30, "activation": "relu"}, "name": "dense_14", "class_name": "Dense", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_15", "units": 60, "activation": "relu"}, "name": "dense_15", "class_name": "Dense", "inbound_nodes": [[["dense_14", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_17", "units": 120, "activation": "relu"}, "name": "dense_17", "class_name": "Dense", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_19", "units": 60, "activation": "relu"}, "name": "dense_19", "class_name": "Dense", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_6", "trainable": true}, "name": "dropout_6", "class_name": "Dropout", "inbound_nodes": [[["dense_15", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_18", "units": 10, "activation": "relu"}, "name": "dense_18", "class_name": "Dense", "inbound_nodes": [[["dense_17", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_20", "units": 30, "activation": "relu"}, "name": "dense_20", "class_name": "Dense", "inbound_nodes": [[["dense_19", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_22", "units": 100, "activation": "relu"}, "name": "dense_22", "class_name": "Dense", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_24", "units": 5, "activation": "relu"}, "name": "dense_24", "class_name": "Dense", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_16", "units": 10, "activation": "relu"}, "name": "dense_16", "class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_7", "trainable": true}, "name": "dropout_7", "class_name": "Dropout", "inbound_nodes": [[["dense_18", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_8", "trainable": true}, "name": "dropout_8", "class_name": "Dropout", "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_9", "trainable": true}, "name": "dropout_9", "class_name": "Dropout", "inbound_nodes": [[["dense_22", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_10", "trainable": true}, "name": "dropout_10", "class_name": "Dropout", "inbound_nodes": [[["dense_24", 0, 0, {}]]]}, {"config": {"name": "add_2", "trainable": true}, "name": "add_2", "class_name": "Add", "inbound_nodes": [[["dense_16", 0, 0, {}], ["dropout_7", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_21", "units": 15, "activation": "relu"}, "name": "dense_21", "class_name": "Dense", "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_23", "units": 20, "activation": "relu"}, "name": "dense_23", "class_name": "Dense", "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_25", "units": 30, "activation": "relu"}, "name": "dense_25", "class_name": "Dense", "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"config": {"axis": -1, "name": "concatenate_2", "trainable": true}, "name": "concatenate_2", "class_name": "Concatenate", "inbound_nodes": [[["add_2", 0, 0, {}], ["dense_21", 0, 0, {}], ["dense_23", 0, 0, {}], ["dense_25", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_26", "units": 1, "activation": "relu"}, "name": "dense_26", "class_name": "Dense", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.4"}